# ClearItems Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..ClearItems Method
RebarContainer Class See Also
---
Clears all the Items stored in this Rebar Container element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void ClearItems()
```

Visual Basic
---
```text
Public Sub ClearItems
```

Visual C++
---
```text
public:
void ClearItems()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace